package com.WindowExample;

public class ZMDUtil 
{
    static int currIndex=0;
	public static String[] MSG=
    {
		"德国大众：“小即是好。” ",
		"可口可乐：“享受清新一刻。” ",
		"万宝路香烟：“万宝路的男人。” ",
		"耐克：“说做就做。”",
		"麦当劳：“你理应休息一天。” ",
		"通用电气：“GE带来美好生活。” ",
		"桌张频酒：“美妙口味不可言传。” ",
		"克莱罗染发水：“她用了？她没用？” ",
		"艾维斯：“我们正在努力。” ",
		"美国联邦快递公司：“快腿勤务员。” ",
		"阿尔卡-舒尔茨公司：“多种广告”。 ",
		"百事可乐：“百事，正对口味。” ",
		"麦氏咖啡：“滴滴香浓，意犹未尽。” ",
		"美国捷运公司：“你知道我吗？” ",
		"美国征兵署：“成为一个全材。” ",
		"Anacin去痛片：“快、快、快速见效。” ",
		"滚石乐队：“感觉是真实的。” ",
		"百事可乐：“新一代的选择。” ",
		"哈斯维衬衫：“穿哈斯维的男人。” ",
		"博马剃须刀：“公路道边的招牌阵。” ",
		"美国汉堡王：“带着它上路。” ",
		"迪比尔斯：“钻石恒久远，一颗永留传。” "
    };
	
	public static String next()
	{
		String result=MSG[currIndex];
		currIndex=(currIndex+1)%MSG.length;
		return result;
		
	}
}
